In [2]:
# importing pandas as pd 
import pandas as pd 
import numpy as np
# dictionary of lists 
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"], 
        'degree': ["MBA", "BCA", "M.Tech", "MBA"], 
        'score':[90, 40, 80, 98]} 
  
# creating a dataframe from dictionary  
df = pd.DataFrame(dict) 
df.set_index('name',inplace=True)
# using a itertuples()

In [3]:
df

        degree  score
name
aparna     MBA     90
pankaj     BCA     40
sudhir  M.Tech     80
Geeku      MBA     98

In [4]:
df.loc['aparna','degree']

'MBA'

In [5]:
a=df.to_numpy()

In [7]:
a.reshape(-1,1)

array([['MBA'],
       [90],
       ['BCA'],
       [40],
       ['M.Tech'],
       [80],
       ['MBA'],
       [98]], dtype=object)